import enum, re

class CharType(enum.Enum):
    OTHERS = -1
    HIRAGANA = 0 
    KATAKANA = 1 
    JOYOKANJI = 2
    KANJI = 3
    ROMAN = 4
    THAI = 5

def get_char_type(char: str) -> CharType:
    p = re.compile('[\u2E80-\u2FDF\u3005-\u3007\u3400-\u4DBF\u4E00-\u9FFF\uF900-\uFAFF\U00020000-\U0002EBEF]')
    if 'ァ' <= char <= 'ヾ':
        return CharType.KATAKANA
    elif 'ぁ' <= char <= 'ゞ':
        return CharType.HIRAGANA
    elif char not in '\n\t ' and char in JOYO_ALL:
        return CharType.JOYOKANJI
    elif re.match(p, char):
        return CharType.KANJI
    elif 'A' <= char <= 'z':
        return CharType.ROMAN
    elif 'ก' <= char <= '๙':
        return CharType.THAI
    else:
        return CharType.OTHERS


def hira2kata(text:str) -> str:
    """
    convert hiragana text into katakana

    >>> hira2kata('あした５じにマルキュー')
    'アシタ５ジニマルキュー'
    """
    return ''.join([chr(ord(c)+96) if get_char_type(c) == CharType.HIRAGANA else c for c in text])


def kata2hira(text:str) -> str:
    """
    convert katakana text into hiragana
    """
    return ''.join([chr(ord(c)-96) if get_char_type(c) == CharType.KATAKANA else c for c in text])


def is_hiragana(text:str) -> bool:
    """
    check if the all chars are hiragana
    """
    return all(get_char_type(c) == CharType.HIRAGANA for c in text)


def is_katakana(text:str) -> bool:
    """
    check if the all chars are katakana
    """
    return all(get_char_type(c) == CharType.KATAKANA for c in text)


def is_roman(text:str) -> bool:
    return all(get_char_type(c) == CharType.ROMAN for c in text)

def is_thai(text:str) -> bool:
    return all(get_char_type(c) == CharType.THAI for c in text)

def is_kanji(text:str) -> bool:
    return all(get_char_type(c) in [CharType.KANJI, CharType.JOYOKANJI] for c in text)


# 常用漢字 2136
JOYO_ALL="""亜哀挨愛曖悪握圧扱宛嵐安案暗以衣位囲医依委威為畏胃尉異移萎偉椅彙意違維慰遺緯域育一壱逸茨芋引印因咽姻
            員院淫陰飲隠韻右宇羽雨唄鬱畝浦運雲永泳英映栄営詠影鋭衛易疫益液駅悦越謁閲円延沿炎怨宴媛援園煙猿遠鉛塩
            演縁艶汚王凹央応往押旺欧殴桜翁奥横岡屋億憶臆虞乙俺卸音恩温穏下化火加可仮何花佳価果河苛科架夏家荷華菓
            貨渦過嫁暇禍靴寡歌箇稼課蚊牙瓦我画芽賀雅餓介回灰会快戒改怪拐悔海界皆械絵開階塊楷解潰壊懐諧貝外劾害崖
            涯街慨蓋該概骸垣柿各角拡革格核殻郭覚較隔閣確獲嚇穫学岳楽額顎掛潟括活喝渇割葛滑褐轄且株釜鎌刈干刊甘汗
            缶完肝官冠巻看陥乾勘患貫寒喚堪換敢棺款間閑勧寛幹感漢慣管関歓監緩憾還館環簡観韓艦鑑丸含岸岩玩眼頑顔願
            企伎危机気岐希忌汽奇祈季紀軌既記起飢鬼帰基寄規亀喜幾揮期棋貴棄毀旗器畿輝機騎技宜偽欺義疑儀戯擬犠議菊
            吉喫詰却客脚逆虐九久及弓丘旧休吸朽臼求究泣急級糾宮救球給嗅窮牛去巨居拒拠挙虚許距魚御漁凶共叫狂京享供
            協況峡挟狭恐恭胸脅強教郷境橋矯鏡競響驚仰暁業凝曲局極玉巾斤均近金菌勤琴筋僅禁緊錦謹襟吟銀区句苦駆具惧
            愚空偶遇隅串屈掘窟熊繰君訓勲薫軍郡群兄刑形系径茎係型契計恵啓掲渓経蛍敬景軽傾携継詣慶憬稽憩警鶏芸迎鯨
            隙劇撃激桁欠穴血決結傑潔月犬件見券肩建研県倹兼剣拳軒健険圏堅検嫌献絹遣権憲賢謙鍵繭顕験懸元幻玄言弦限
            原現舷減源厳己戸古呼固股虎孤弧故枯個庫湖雇誇鼓錮顧五互午呉後娯悟碁語誤護口工公勾孔功巧広甲交光向后好
            江考行坑孝抗攻更効幸拘肯侯厚恒洪皇紅荒郊香候校耕航貢降高康控梗黄喉慌港硬絞項溝鉱構綱酵稿興衡鋼講購乞
            号合拷剛傲豪克告谷刻国黒穀酷獄骨駒込頃今困昆恨根婚混痕紺魂墾懇左佐沙査砂唆差詐鎖座挫才再災妻采砕宰栽
            彩採済祭斎細菜最裁債催塞歳載際埼在材剤財罪崎作削昨柵索策酢搾錯咲冊札刷刹拶殺察撮擦雑皿三山参桟蚕惨産
            傘散算酸賛残斬暫士子支止氏仕史司四市矢旨死糸至伺志私使刺始姉枝祉肢姿思指施師恣紙脂視紫詞歯嗣試詩資飼
            誌雌摯賜諮示字寺次耳自似児事侍治持時滋慈辞磁餌璽鹿式識軸七𠮟失室疾執湿嫉漆質実芝写社車舎者射捨赦斜煮
            遮謝邪蛇尺借酌釈爵若弱寂手主守朱取狩首殊珠酒腫種趣寿受呪授需儒樹収囚州舟秀周宗拾秋臭修袖終羞習週就衆
            集愁酬醜蹴襲十汁充住柔重従渋銃獣縦叔祝宿淑粛縮塾熟出述術俊春瞬旬巡盾准殉純循順準潤遵処初所書庶暑署緒
            諸女如助序叙徐除小升少召匠床抄肖尚招承昇松沼昭宵将消症祥称笑唱商渉章紹訟勝掌晶焼焦硝粧詔証象傷奨照詳
            彰障憧衝賞償礁鐘上丈冗条状乗城浄剰常情場畳蒸縄壌嬢錠譲醸色拭食植殖飾触嘱織職辱尻心申伸臣芯身辛侵信津
            神唇娠振浸真針深紳進森診寝慎新審震薪親人刃仁尽迅甚陣尋腎須図水吹垂炊帥粋衰推酔遂睡穂随髄枢崇数据杉裾
            寸瀬是井世正生成西声制姓征性青斉政星牲省凄逝清盛婿晴勢聖誠精製誓静請整醒税夕斥石赤昔析席脊隻惜戚責跡
            積績籍切折拙窃接設雪摂節説舌絶千川仙占先宣専泉浅洗染扇栓旋船戦煎羨腺詮践箋銭潜線遷選薦繊鮮全前善然禅
            漸膳繕狙阻祖租素措粗組疎訴塑遡礎双壮早争走奏相荘草送倉捜挿桑巣掃曹曽爽窓創喪痩葬装僧想層総遭槽踪操燥
            霜騒藻造像増憎蔵贈臓即束足促則息捉速側測俗族属賊続卒率存村孫尊損遜他多汰打妥唾堕惰駄太対体耐待怠胎退
            帯泰堆袋逮替貸隊滞態戴大代台第題滝宅択沢卓拓託濯諾濁但達脱奪棚誰丹旦担単炭胆探淡短嘆端綻誕鍛団男段断
            弾暖談壇地池知値恥致遅痴稚置緻竹畜逐蓄築秩窒茶着嫡中仲虫沖宙忠抽注昼柱衷酎鋳駐著貯丁弔庁兆町長挑帳張
            彫眺釣頂鳥朝貼超腸跳徴嘲潮澄調聴懲直勅捗沈珍朕陳賃鎮追椎墜通痛塚漬坪爪鶴低呈廷弟定底抵邸亭貞帝訂庭逓
            停偵堤提程艇締諦泥的笛摘滴適敵溺迭哲鉄徹撤天典店点展添転塡田伝殿電斗吐妬徒途都渡塗賭土奴努度怒刀冬灯
            当投豆東到逃倒凍唐島桃討透党悼盗陶塔搭棟湯痘登答等筒統稲踏糖頭謄藤闘騰同洞胴動堂童道働銅導瞳峠匿特得
            督徳篤毒独読栃凸突届屯豚頓貪鈍曇丼那奈内梨謎鍋南軟難二尼弐匂肉虹日入乳尿任妊忍認寧熱年念捻粘燃悩納能
            脳農濃把波派破覇馬婆罵拝杯背肺俳配排敗廃輩売倍梅培陪媒買賠白伯拍泊迫剝舶博薄麦漠縛爆箱箸畑肌八鉢発髪
            伐抜罰閥反半氾犯帆汎伴判坂阪板版班畔般販斑飯搬煩頒範繁藩晩番蛮盤比皮妃否批彼披肥非卑飛疲秘被悲扉費碑
            罷避尾眉美備微鼻膝肘匹必泌筆姫百氷表俵票評漂標苗秒病描猫品浜貧賓頻敏瓶不夫父付布扶府怖阜附訃負赴浮婦
            符富普腐敷膚賦譜侮武部舞封風伏服副幅復福腹複覆払沸仏物粉紛雰噴墳憤奮分文聞丙平兵併並柄陛閉塀幣弊蔽餅
            米壁璧癖別蔑片辺返変偏遍編弁便勉歩保哺捕補舗母募墓慕暮簿方包芳邦奉宝抱放法泡胞俸倣峰砲崩訪報蜂豊飽褒
            縫亡乏忙坊妨忘防房肪某冒剖紡望傍帽棒貿貌暴膨謀頰北木朴牧睦僕墨撲没勃堀本奔翻凡盆麻摩磨魔毎妹枚昧埋幕
            膜枕又末抹万満慢漫未味魅岬密蜜脈妙民眠矛務無夢霧娘名命明迷冥盟銘鳴滅免面綿麺茂模毛妄盲耗猛網目黙門紋
            問冶夜野弥厄役約訳薬躍闇由油喩愉諭輸癒唯友有勇幽悠郵湧猶裕遊雄誘憂融優与予余誉預幼用羊妖洋要容庸揚揺
            葉陽溶腰様瘍踊窯養擁謡曜抑沃浴欲翌翼拉裸羅来雷頼絡落酪辣乱卵覧濫藍欄吏利里理痢裏履璃離陸立律慄略柳流
            留竜粒隆硫侶旅虜慮了両良料涼猟陵量僚領寮療瞭糧力緑林厘倫輪隣臨瑠涙累塁類令礼冷励戻例鈴零霊隷齢麗暦歴
            列劣烈裂恋連廉練錬呂炉賂路露老労弄郎朗浪廊楼漏籠六録麓論和話賄脇惑枠湾腕"""


# 漢検準一級レベルの漢字
JUNICHI_ALL = """㵎丑丞乃之乍乎也云亘亙些亥亦亨亮什仇仔伊伍伶伽佃佑佼侃侠俄俠俣俱倖倦倭倶偓偲傭僑僻儘儲允兇兎兔兜其冴
            凋凌凧凪凰凱函凾剃劃劉劫勺勿匁匙匝匡匪卜卦卯卿厨厩厭厰叉叛叡叢叩只叶吃吊吋吞吠吻吾呆呑咒咳哉哨哩唖啄
            啐啞喋喧喬喰嘉嘗嘘嘩噂噌噓噛噸噺嚙嚢囊圃圭坐坤坦垢埜埠埴堰堵堺塘塙塵壕壬壷壺夙夷奄套妓妾姐姑姥姦姪姶
            娃娩娼婁嬉嬬嬰孜孟宋宍宏宕宥寅寓寵尖尤尭屍屑屡屢岨岱峨峩峯峻崕嵩嵯嵳嶋嶺巌巳巴巷巽帀帖幌幡庄庇庖庚庵
            廏廐廓廚廟廠廻廼廿弗弘弛弼彊彦彪彬徽忽怜怯恕恢恰悉悌悶惇惚惟惣惹愈慧慾憐戊戎或戟托扮按挺挽捌捧捲捷捺
            掠掩掬掴掻揃揖搔摑摸摺撒撚撞撫播撰撹擢擾攪敦斌斐斡斧斯於旭昂昌昏晃晋晒晦智暢曙曝曳朋朔李杏杓杖杜杢杭
            杵杷枇柁柊柏柑柘柚柴柾栂栖栗栴桂桐桓桔桧桶梁梓梢梧梯梱梶梼棉棲椀椋椙椛椴椿楊楓楕楚楠楢楯楳榊榎榛槌槍
            槙槻樋樗樟樫樵樺樽橘橡橢橿檀檎檜檮櫓櫛欣欽歎此歪殆毅毗毘汀汐汝汲沌沓沫洛洩洲浩浬涌涛涜淀淋淘淳淵渕渚
            渠渥湊湘湛溌溜溢溯漉漑漕漣潅潑潴澗澱濠濡濤瀆瀕瀞瀦灌灘灸灼烏烹焔焚焰煉煤煽熔燐燕燦燭爺爾牌牒牝牟牡牢
            牽犀狐狗狛狸狼狽猪猷獅玖玲珂珊珪琉琢琳琵琶瑚瑛瑞瑳瓜瓢甑甜甥甫畠畢畦畷疋疏疹痔癌皋皐盃盈盌瞥矧矩砥砦
            砧砺砿硯硲碇碍碓碗碧碩磐磯礦礪祁祇祐祢祷禄禎禦禰禱禽禾禿秤秦稀稔稗稜穆穎穐穣穿窄窪窺竃竈竣竪竺竿笈笠
            笥笹筈筏筑箆箔箕箪箭篇篠篦篭簞簸簾籾粁粂粍粕粟粥糊糎糞糟糠紐紗紘紬絃絢綜綬綴綾緋緬縞繋繍繡繫纂纏纒罫
            翆翠翫翰耀而耶耽聡聨聯聾肇肋肱肴胡胤脆脹腔腿膏膿臥舘舛舜舵艮芙芥芭芹苅苑苒苓苔苧苫茄茅茜茸荆荊荏荻莞
            莫莱莵菅菖菟菩菰菱萄萊萌萠萩萱葎葡葢董葦葱葵葺蒋蒐蒔蒙蒜蒲蒼蓉蓑蓬蓮蔀蔓蔚蔣蔦蔭蕃蕉蕊蕋蕎蕗蕨蕩蕪薗
            薙薩薮薯藁藪藷蘂蘇蘭虻蚤蛋蛎蛙蛛蛤蛭蛸蛾蜎蜘蝉蝋蝕蝦蝱蝶蝿螺蟬蟹蟻蠅蠏蠟蠣衿袈袴袷裟裡裳襖覗訊訣註詑
            詫誹誼諌諏諒諜諫諺謂謬讃讚豎豹貰賎賑賤贋赫趨跨蹄蹟躯軀輔輯輿轍轟轡辰辻辿迂迄迦迺逗這逢逼遁遥遼邑郁鄭
            酉酋醇醍醐醗醤醬醱釘釦釧鈎鈷鉤鉦鉾銑銚鋒鋤鋪鋲鋸錆錐錘錨錫鍍鍔鍬鍾鎔鎗鎚鎧鏑鐙鐸鑓閃閏閤阿陀隈隼雀雁
            雛雫霞靖靭靱鞄鞍鞘鞠鞭韃韭韮頁頗頚頴頸顚顛飴餐饗馨馳馴駁駈駕駿騨驒髭魁魯鮎鮒鮪鮫鮭鯉鯖鯛鯵鰍鰐鰭鰯鰹
            鰺鰻鱈鱒鱗鳩鳳鳶鴇鴈鴎鴛鴦鴨鴫鴬鴻鵜鵠鵡鵬鶯鷗鷲鷹鷺鸚鹸鹼麒麟麪麴麹麿黍黛鼎鼠龝"""


# 漢検一級レベルの漢字
IKKYUU_ALL = """丐丕丫丱乂乖于亟亢亶仂仄仆仍仗仞仟价伉估佇佗佚佝佞佩佯佰佶佻侈侏侑侖侘俎俐俑俔俘俚俛俟俤俥俯俶俾倅倆
            倏們倔倚倡倥倨倩倪倬偃偈偐偕偖做偬偸傀傅傚傴僂僉僖僥僭僮僵儁儂儔儕儚儡儳儷儺儻儼兀兌兢兪冀冏冑冕冢冤
            冪冱冽凅凊凜几凩凭刋刎刔刪刮刳剄剋剌剔剞剪剳剴剽剿劈劬劭劼勁勍勒勖勠勣勦匆匈匍匏匐匕匚匣匯匱匳卅卉卍
            卮厖厥厲叟叨叭叮叺吁吝吩听吭吮吶吼吽呎呏呟呰呵呶呷呻咀咄咆咎咏咐咢咤咥咨咫咬咸哂哄哇哈哢哥哦哭哮哳哽
            唏唔售唸啀啅啖啜啣啻啼啾喀喃喇喊喑喘喙喞喟喨嗄嗇嗔嗚嗜嗟嗤嗷嗽嗾嘔嘖嘛嘯嘴嘶嘸噁噎噤噦噪噫噬噯嚀嚆嚊
            嚔嚠嚥嚬嚮嚶嚼囀囁囂囃囈囹囿圄圉圜圦圻址坎坏坡坩坿垓垠垤埃埆埒堊堝堡塋塒塹塿墅墟壅壎壑壙壜壟壼夥夬夭
            夲夸夾奎奐奕奘奚奠奢奸妝妣妲姆姙姚姜姨姮姸娉娑娟娥娵娶婀婉婢婪婬媚媼媽嫋嫖嫗嫣嫩嫺嫻嬋嬌嬖嬪嬲嬶嬾孀
            孅孑孒孕孚孛孥孩孰孱孵孺孼宦宸寇寐寔寞寤寥寨寰尠尨尸尹屁屎屛屠屭屶屹岌岑岔岫峙峪峭崑崔崙崚崛崟崢嵋嵌
            嵎嵒嵬嶂嶄嶇嶝嶢嶬嶮嶷嶼巉巍巒巓巫已帑帙帚帛帷幀幃幄幎幔幗幟幢幫幵幷幺庠廁廂廈廖廛廝廡廨廩廬廱弋弌弍
            弑弖弩弭彎彗彝彭彷彽彿徂徇很徊徘徙徨徭徼忖忝忤忱忸忻忿怎怏怕怙怛怡怦怩怫怱怺恁恂恃恊恍恙恚恟恤恪恫恬
            悁悃悄悋悍悒悖悚悛悧悴悵悸悽悾惆惓惘惴惶惷惺惻愀愃愆愍愎愒愕愧愨愬愴愾愿慂慇慊慍慓慙慝慟慠慥慫慳慴慵
            慷憊憑憔憖憚憫憮憺懃懆懈懊懋懌懍懣懦懶懺懼懽懾懿戈戉戌戍戔戛戡截戮戳扁扎扛扞扠扣扨扼找抃抉抒抓抔抖抻
            拆拇拈拊拌拑拗拮拯拱拵拿挂挈挌挘捍捏捐捫捶掀掉掎掏掖掟掣掫掾揀揄揆揉揣揩揶搏搓搗搤搦搨搴搶摎摏摧摶撈
            撓撕撥撩撻撼擂擅擒擘擠擡擣擯擱擲擺擽攀攘攢攣攤攫攬敖敝敞敲斂斃斛斟斫旁旃旄旆旌旛旰旱旻昃昊昜昴昵昶晁
            晏晞晟晢晤晧晨晰暄暈暉暘暝暹暾曚曠曦曩曬曰曷曼朏朞朦朧朮朶朸朿杆杙杞杠杣杪杲杳杼枉枋枌枡枳枴枷枸枹柎
            柝柞柢柤柩柬柮柯栞栩栫栲桄框桎桙桛桴桷梃梏梔梟梠梭梲梵梺梻棍棕棗棘棠棣棹椁椄椈椏椒椚椰椹椽楔楝楡楫楮
            楸楹楾榀榁榑榔榕榜榧榱榴榻榾槁槃槊槎槐槓槧槨槭槲槿樅樊樒樔樛樸橄橇橈橙橦檄檋檐檔檗檠檣檬檳檸檻櫂櫃櫚
            櫟櫨櫪櫱櫺欅欒欖欷欸欹歃歇歉歔歙歛歟歠歿殀殃殄殍殞殤殪殫殯殲殷毋毟毫毬毯毳氈氓氛汕汞汨汪沁沂沍沐沚沛
            沮沱沽沾泄泅泓泗泛泝泪泯洌洒洟洫洵洶洸洽浙浚浣浹涅涎涓涕涵涸淅淆淌淒淙淪淬淹渙渝渟渣渫渭游渺渾湃湍湎
            湫湲溂溏溘溟溥溲溷溽滂滄滉滌滓滔滲滷滸滾漓漱漲漾漿潘潦潯潸潺澆澎澡澣澪澳澹濔濘濛濬濺濾瀁瀉瀋瀏瀑瀚瀝
            瀟瀰瀲瀾灑炒炙炬炮炯炷炸烋烙烝烽焉焙焜焠煌煖煥煦煬熄熕熙熨熬熹熾燉燎燔燗燠燧燬燮燵燹燻燼燿爍爛爨爬爰
            牀牆牋牖牘牴牾犂犇犒犖犢犲狃狄狆狎狒狠狡狢狷猊猋猖猗猜猝猥猩猯猴猾獏獗獪獮獰獺玫玻珀珈珞珥珮琅琥琲琺
            瑁瑇瑕瑙瑜瑟瑣瑩瑪瑰瑶瑾璇璋璞瓏瓔瓧瓩瓮瓰瓱瓲瓷瓸甃甅甌甍甎甓甕甦甸畋畚畛畤畬畸疆疇疔疚疝疣疥疱疳疵
            疸疼疽痂痃痊痍痒痙痞痣痰痲痳痹痺痼痾痿瘁瘉瘋瘟瘠瘡瘢瘤瘧瘰瘴瘻癆癇癈癘癜癢癧癨癩癪癬癭癰癲癴癸皁皎皓
            皖皙皚皰皴皹皺盂盍盒盞盥盧盪盻眄眇眈眛眥眩眷眸睇睚睛睥睨睫睹睾瞋瞎瞑瞞瞠瞰瞻瞼瞽瞿矇矍矚矜矣矮矻矼砌
            砒砠硅碌碚碣碪碼碾磅磊磋磑磚磧磬磴磽礑礒礙礫礬祀祓祗祚祟祠祺禊禝禧禳禹禺秉秕秣秧秬稈稍稟稠稷穡穢穹穽
            窈窕窖窘窩窶窿竄竅竇竍竏竓竕站竚竟竡竢竦竭竰竽笆笊笏笘笙笞笨笳笵筅筌筍筐筥筧筮筰筱筲筴筵箍箏箒箘箚箜
            箝箴篁篆篋篌篝篥篩篪篷簀簇簍簑簓簗簣簧簫簷簽籃籌籒籔籙籟籡籤籥籬籵粏粢粤粨粱粲粳粽糀糂糅糒糜糝糯糲糴
            糶糺紂紆紉紊紕紜紮紲紵紿絅絆絎絏絖絛絣絨絮絳絽綉綏綢綣綦綫綯綰綵綸綺綽緇緘緝緞緡緤緲縅縉縊縋縒縕縟縡
            縲縵縷縹縺縻繆繖繙繚繝繞繧繳繹繻繽纃纈纊纐纓纔纘纛纜缸罅罌罍罎罔罕罘罟罠罧罨罩罹羂羃羆羇羈羌羔羚羝羯
            羲羶羸羹翅翊翔翕翡翦翳翹耄耆耋耘耙耡耦耨耿聆聊聒聘聚聢聳聶聿肄肆肚肛肬肭胄胖胙胚胛胝胥胯胱脛脣脩脯脾
            腆腋腑腓腠腥腮腱腴膀膂膃膈膊膠膣膩膰膵膺膾臀臂臉臍臑臘臙臚臠臧臻臾舂舅舐舒舫舳舸艀艘艙艚艝艟艢艤艨艪
            艫艱艸艾芒芟芫芬芸芻苆苙苜苞苟苡苳苴苹苺苻范茆茉茗茘茣茫茯茱茲茴茵茹荀荅荐荳荼莅莉莎莚莟莠莢莨莪菁菎
            菘菠菫菲菴菽萁萃萍萵萸萼葆葩葭葷蒟蒡蒹蒻蒿蓁蓆蓍蓐蓖蓙蓼蓿蔔蔕蔗蔘蔟蔡蕀蕁蕕蕘蕣蕭蕷蕾薀薇薈薊薏薐薑
            薔薛薜薤薨薹薺藉藐藕藜藹藺藾蘆蘊蘋蘚蘢蘿虒虔虧蚌蚓蚣蚩蚪蚫蚯蚰蚶蛄蛆蛉蛔蛞蛟蛬蛯蛹蛻蜀蜃蜆蜈蜉蜊蜍蜑
            蜒蜓蜚蜥蜩蜴蜷蜹蜻蜿蝌蝎蝓蝗蝘蝟蝠蝣蝨蝮蝲蝴蝸螂螈螗螟螫螯螳螻螾蟀蟄蟇蟋蟎蟠蟪蟯蟶蟷蟾蠆蠊蠍蠑蠕蠖蠡
            蠢蠱蠹衄衍衒衙衢衫衲衵衾袂袍袒袗袙袢袤袰袱袵袿裃裄裎裔裘裙裨裲裴裹裼褂褄褌褓褞褥褪褫褶褸褻襁襄襌襞襠
            襤襦襭襯襴襷覃覈覓覘覡覦覩覬覲覿觜觝觥觴訌訐訖訛訝訥訶詁詆詈詒詛詢詬詭詼誂誄誅誑誚誡誣誥誦誨諂諄諍諚
            諠諡諢諤諱諳諷謇謐謔謖謗謦謨謫謳謾譌譎譏譖譚譟譫譬譴讌讐讒讖讙谿豈豌豕豢豺貂貉貊貎貘貲貶貽賈賚賺賻賽
            贄贅贇贍贐贓贔贖赧赬赭赳趁趙趺趾跂跋跌跎跏跖跚跛跟跣跪跼跿踉踑踝踞踟踰踴踵蹂蹇蹈蹉蹊蹌蹐蹙蹠蹣蹤蹲蹶
            蹻蹼躁躄躅躇躊躋躑躓躔躡躪躬躮躱躾軈軋軛軫軻軼軾輀輅輊輒輓輛輜輟輦輳輹輻輾轂轅轆轌轎轗轢轤辜辟辮辷迚
            迢迥迪迴迹逅逋逍逑逕逖逞逡逧逵逾遉遏遐遑遒遖遨遯遶遽邀邁邂邇邏邨邯邱邵郛郢郤鄂鄒鄙鄲酊酖酣酥酩酲酳醂
            醋醢醪醴醵醺釉釐釵釿鈑鈔鈕鈞鈿鉅鉈鉉鉋鉗鉞銓銕銖銛銜銷銹鋏鋺錏錙錚錣錵錺錻鍠鍮鍼鎬鎰鎹鎺鏃鏈鏐鏖鏗鏘
            鏝鏤鏨鐃鐐鐓鐚鐫鐶鐺鑞鑠鑢鑪鑰鑷鑼鑽鑾鑿钁閂閊閔閘閧閨閭閹閻閾闃闊闌闍闔闕闖闡闢闥阡阨阮阯陂陌陜陝陞
            陟陬陲隋隍隕隗隘隧隰隴雉雋雍雎雕雖雹霄霆霈霍霎霏霑霓霖霙霤霪霰霹霽霾靂靄靆靉靠靡靤靦靨靫靺靼鞁鞅鞋鞐
            鞜鞣鞦鞨鞫鞳鞴韋韞韶頌頏頡頤頷頽顆顋顫顬顰顱顳顴颪颯颱颶飄飆飩飫飭餃餉餒餔餞餡餤餬餮餽餾饂饅饉饋饌饐
            饑饒饕馗馘馥馭馮駑駘駛駝駟駭駮駱駸駻騁騅騏騙騫騭騾驀驂驃驍驎驕驟驢驤驥驩驪骭骰骼髀髏髑髢髣髦髫髱髴髷
            髻鬆鬘鬚鬟鬢鬣鬧鬨鬩鬮鬯鬻魃魄魍魎魏魑魘魞魬魳魴魸鮃鮇鮑鮓鮖鮟鮠鮨鮱鮲鮴鮸鮹鯀鯊鯎鯏鯐鯑鯒鯔鯡鯢鯣鯤
            鯰鯱鰄鰆鰈鰉鰊鰌鰒鰓鰔鰕鰘鰙鰚鰤鰥鰧鰮鰰鰾鱆鱇鱏鱓鱚鱛鱟鱠鱧鱩鱲鱶鱸鳧鳰鴃鴆鴉鴒鴕鴟鴣鴾鴿鵁鵄鵆鵇鵑
            鵝鵤鵥鵯鵲鵺鶄鶇鶉鶍鶎鶚鶤鶩鶪鶫鶲鶸鶺鶻鷁鷂鷆鷓鷙鷦鷭鷯鷸鷽鸛鸞鹵鹹麈麋麌麑麕麝麤麩麭麼麾黌黎黐黔黜
            黝黠黥黯黴黶黷黹黻黼黽鼇鼈鼕鼬鼯鼴鼾齎齏齟齠齣齦齧齪齬齲齶齷龐龕龠﨟"""